Revit 2027 API
SpatialFieldManager.GetLegend Method
 Returns legend element or NULL
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public AnalysisDisplayLegend GetLegend()
Public Function GetLegend As AnalysisDisplayLegend
public:
AnalysisDisplayLegend^ GetLegend()
member GetLegend : unit -> AnalysisDisplayLegend
Return Value
AnalysisDisplayLegend
 The legend element or NULL
See Also
Reference
SpatialFieldManager Class
Autodesk.Revit.DB.Analysis Namespace